CSI API ETABS v1

# cAnalysisResultsSetupGetOptionModalHist Method

---

Retrieves the output option for modal history results.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetOptionModalHist(
    	ref int Value
    )

    Function GetOptionModalHist (
    	ByRef Value As Integer
    ) As Integer

    Dim instance As cAnalysisResultsSetup
    Dim Value As Integer
    Dim returnValue As Integer

    returnValue = instance.GetOptionModalHist(Value)

    int GetOptionModalHist(
    	int% Value
    )

    abstract GetOptionModalHist :
            Value : int byref -> int

#### Parameters

Value

    Type: SystemInt32
This item is 1, 2 or 3

  1. Envelopes
  2. Step-by-Step
  3. Last Step

#### Return Value

Type: Int32
Returns zero if the output option is successfully retrieved, otherwise it
returns nonzero.

Remarks

Examples

VB

Copy

    Public Sub Example()
           Dim SapModel As cSapModel
           Dim EtabsObject As cOAPI
           Dim ret As Integer = -1
           Dim Selected As Boolean
           Dim Value As Integer

       'create ETABS object
           Dim myHelper as cHelper = New Helper
           EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

       'start ETABS application
           ret = EtabsObject.ApplicationStart()

       'create SapModel object
           SapModel = EtabsObject.SapModel

       'initialize model
           ret = SapModel.InitializeNewModel()

       'create steel deck template model
           ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)

       'get output option
           ret = SapModel.Results.Setup.GetOptionModalHist(Value)

       'close ETABS
           EtabsObject.ApplicationExit(False)

       'clean up variables
           SapModel = Nothing
           EtabsObject = Nothing
       End Sub

See Also

#### Reference

cAnalysisResultsSetup Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com